# Pandas Practice Notebook

# - DATAFRAMES

### Loading Library

In [1]:
import pandas as pd
import numpy as np

### 1. Create DataFrame

In [2]:
data = {
    'roll_no': [3, 2, 7, 11],
    'ppr_id': [34, 21, 10, 11],
    'marks': [30, 23, 17, 27]
}
# creating a dataset

In [3]:
data
# printing the dataset

{'roll_no': [3, 2, 7, 11],
 'ppr_id': [34, 21, 10, 11],
 'marks': [30, 23, 17, 27]}

In [4]:
df1 = pd.DataFrame(data)
# variable = pd.DataFrame(datsetname)
# pd.Dataframe function helps in creation of a dataset.

In [5]:
df1
# The index is by default 0,1,2,3.... and can be changed to desired as required, as seen in the next section.

   roll_no  ppr_id  marks
0        3      34     30
1        2      21     23
2        7      10     17
3       11      11     27

### 2. Setting Index

In [6]:
df2 = pd.DataFrame(data, index=['Vivek', 'Vedant', 'Yash', 'Rohan'])
# creating a new DataFrame by passing the dataset and also specifying specific index names for each record.

In [7]:
df2

        roll_no  ppr_id  marks
Vivek         3      34     30
Vedant        2      21     23
Yash          7      10     17
Rohan        11      11     27

### 3. Extracting Info

In [8]:
df2.loc['Vivek']
# dataframeName.loc['to find']
# helps to extract the record pertaining to that data.

roll_no     3
ppr_id     34
marks      30
Name: Vivek, dtype: int64

In [9]:
df2.iloc[:, -1]
# df2.iloc[: meaning all rows, column no.] note- for accesing last column / row, use -1.
# function to extract all rows's last column (index is print by default for ref)

Vivek     30
Vedant    23
Yash      17
Rohan     27
Name: marks, dtype: int64

In [10]:
df2.iloc[2:4,1:3]
# df2.iloc[row index starting from: row index ending before, column index starting from: column index ending before  ]

       ppr_id  marks
Yash       10     17
Rohan      11     27

# - Working on CSV

### 1. Loading Data

In [11]:
df = pd.read_csv('C:\\Users\\Vivek hotti\\Desktop\\Practice\\ML DA\\iris.csv')

In [12]:
df.head()
# prints first five elements of the data by default

   sepal_length  sepal_width  petal_length  petal_width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [13]:
df.head(10)
# df.head(no.of elements)
# prints the first n number of elements of your dataframe

   sepal_length  sepal_width  petal_length  petal_width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

### 2. Data Info

In [14]:
df.info()
# general info about the table

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

### 3. Data Description

In [15]:
df.describe()
# in detail statistical details / descriptions of each column

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### 4. Data Selection

In [16]:
df.head(10)

   sepal_length  sepal_width  petal_length  petal_width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

##### Single Column

In [17]:
df['sepal_width'][:5]
# selection and printing first 5 values from the column sepal_width
# below is in the form of data items

0    3.5
1    3.0
2    3.2
3    3.1
4    3.6
Name: sepal_width, dtype: float64

In [18]:
df[['sepal_width']][:5]
# selection and printing first 5 values from the column sepal_width
# below is in the form of dataframe.

   sepal_width
0          3.5
1          3.0
2          3.2
3          3.1
4          3.6

In [19]:
df[['sepal_width']][3:7]
# df[['column name']][row index starting from: row index ending before]
# selecting & displaying records that start from 3rd index but end before the 7th index .i.e 3rd index to 6th index.

   sepal_width
3          3.1
4          3.6
5          3.9
6          3.4

##### Two / Multiple Columns

In [20]:
df[['sepal_width', 'Species']][:5]
# selecting and printing first five records of two columns specified.

   sepal_width Species
0          3.5  setosa
1          3.0  setosa
2          3.2  setosa
3          3.1  setosa
4          3.6  setosa

In [21]:
df.iloc[:7, [1, 3]]
# selecting and printing first seven records of two non consecutive columns: column index 1 and 3

   sepal_width  petal_width
0          3.5          0.2
1          3.0          0.2
2          3.2          0.2
3          3.1          0.2
4          3.6          0.2
5          3.9          0.4
6          3.4          0.3

### 5. Missing Values

##### 5.1 NULL Values

In [22]:
data = {
    'roll_no': [3, 2, 7, 11],
    'ppr_id': [34, 21, 10, 11],
    'marks': [np.nan, 23, 17, 27]
}
# creating a dataset and inserting a null value in the marks column by using np.nan

In [23]:
df1 = pd.DataFrame(data)
# creating a dataframe of the dataset

In [24]:
df1
# printing the dataframe
# wherever null is present in the dataframe/set, NaN is printed at that position.

   roll_no  ppr_id  marks
0        3      34    NaN
1        2      21   23.0
2        7      10   17.0
3       11      11   27.0

##### 5.2 isnull()

In [25]:
df1.isnull()
# prints true wherever Null value is present. Where real values are present, prints false.

   roll_no  ppr_id  marks
0    False   False   True
1    False   False  False
2    False   False  False
3    False   False  False

In [26]:
df1.isnull().sum()
# gives a summary of the toal number of null values in each column.

roll_no    0
ppr_id     0
marks      1
dtype: int64

##### 5.3 fillna()

In [27]:
df2 = df1.fillna(1)
# creating a new dataframe df2 from df1 where we use a function fillna(value), to replace the specified value with NULL values present in the table.
# In short NaN in the datafram is replaced by the value entered in the bracket.

In [28]:
df2
# printing dataframe 2

   roll_no  ppr_id  marks
0        3      34    1.0
1        2      21   23.0
2        7      10   17.0
3       11      11   27.0

##### 5.4 Dropping NULL Values

In [29]:
df1
# printing df1 with a Null Value.

   roll_no  ppr_id  marks
0        3      34    NaN
1        2      21   23.0
2        7      10   17.0
3       11      11   27.0

In [30]:
a = df1.dropna(axis = 0)
# using the function dropna(axis = 0) that is used to drop Null Values. What it does it that it completely removes the whole singular row containing Null Value.

In [31]:
a
# printing the Null-dropped dataframe.

   roll_no  ppr_id  marks
1        2      21   23.0
2        7      10   17.0
3       11      11   27.0

In [32]:
b = df1.dropna(axis = 1)
# using the function dropna(axis = 1) that is used to drop Null Values. What it does it that it completely removes the whole singular column containing Null Value.

In [33]:
b

   roll_no  ppr_id
0        3      34
1        2      21
2        7      10
3       11      11

##### 5.5 Creating a Data Frame with non-NULL Values

In [34]:
a = df1
a

   roll_no  ppr_id  marks
0        3      34    NaN
1        2      21   23.0
2        7      10   17.0
3       11      11   27.0

In [35]:
a = pd.notnull(df1 ["marks"])

In [36]:
a

0    False
1     True
2     True
3     True
Name: marks, dtype: bool

In [37]:
df1[a]

   roll_no  ppr_id  marks
1        2      21   23.0
2        7      10   17.0
3       11      11   27.0

### 6. Statistics

In [38]:
data = {
    'roll_no': [3, 2, 7, 11],
    'ppr_id': [34, np.nan, 10, 11],
    'marks': [30, 23, 17, 27]
}
# creating a dataset

In [39]:
data
# printing the dataset

{'roll_no': [3, 2, 7, 11],
 'ppr_id': [34, nan, 10, 11],
 'marks': [30, 23, 17, 27]}

In [40]:
df1 = pd.DataFrame(data)
# creating a dataframe

In [41]:
df1
# printing the dataframe

   roll_no  ppr_id  marks
0        3    34.0     30
1        2     NaN     23
2        7    10.0     17
3       11    11.0     27

In [42]:
df1['marks'].sum()
# dataframeName['columnName'].sum()
# Produces the sum of all values / elements in that column

97

In [43]:
df1['marks'].mean()
# dataframeName['columnName'].mean()
# Produces the mean (average) of all values / elements in that column

24.25

In [44]:
df1['marks'].cumsum()
# dataframeName['columnName'].cumsum()
# Produces the cumulative sum for every row in that column

0    30
1    53
2    70
3    97
Name: marks, dtype: int64

In [45]:
df1['roll_no'].count()
# dataframeName['columnName'].count()
# Produces the number of records in the dataframe

4

In [46]:
df1['marks'].min()
# dataframeName['columnName'].min()
# Produces the minimum value in that column

17

In [47]:
df1['marks'].max()
# dataframeName['columnName'].max()
# Produces the maximum value in that column

30

In [48]:
df1['marks'].var()
# dataframeName['columnName'].var()
# Produces the variation of values in that column

31.583333333333332

In [49]:
df1['marks'].std()
# dataframeName['columnName'].std()
# Produces the standard deviation of values in that column

5.619905100029122

In [50]:
df1.corr()
# dataframe.corr()
# Produces correlation of commodities of a dataframe with one another

          roll_no    ppr_id     marks
roll_no  1.000000 -0.847024 -0.082920
ppr_id  -0.847024  1.000000  0.705142
marks   -0.082920  0.705142  1.000000